cmsis-svd/cmsis-svd/data/NXP/LPC11Axxv0.6.xml
			</field>														
			<field>														
				<name>START</name>													
				<description>When the BURST bit is 0, these bits control whether/when an A/D conversion is started. All other values are reserved.</description>													
				<bitRange>[26:23]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>NO_START_THIS_VALUE</name>											
						<description>No start (this value should be used when clearing PDN to 0).</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>START_CONVERSION_NOW</name>											
						<description>Start conversion now.</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>START_CONVERSION_WHE</name>											
						<description>Start conversion when the edge selected by bit 27 occurs on ATRG0.</description>											
						<value>0x4</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>START_CONVERSION_WHE</name>											
						<description>Start conversion when the edge selected by bit 27 occurs on the analog comparator output.</description>											
						<value>0x5</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>START_CONVERSION_WHE</name>											
						<description>Start conversion when the edge selected by bit 27 occurs on ATRG1.</description>											
						<value>0x6</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>START_CONVERSION_WHE</name>											
						<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT0[1].</description>											
						<value>0x8</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>START_CONVERSION_WHE</name>											
						<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT1[1].</description>											
						<value>0xA</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>START_CONVERSION_WHE</name>											
						<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT0[1].</description>											
						<value>0xC</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>START_CONVERSION_WHE</name>											
						<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT1[1].</description>											
						<value>0xE</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>EDGE</name>													
				<description>This bit is significant only when the START field contains 0100-1110. In these cases:</description>													
				<bitRange>[27:27]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>START_CONVERSION_ON_</name>											
						<description>Start conversion on a rising edge on the selected signal.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>START_CONVERSION_ON_</name>											
						<description>Start conversion on a falling edge on the selected signal.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>													
				<bitRange>[31:28]</bitRange>													
												
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>GDR</name>															
		<description>A/D Global Data Register. Contains the result of the most recent A/D conversion.</description>															
		<addressOffset>0x004</addressOffset>															
		<access>read-only</access>															
		<resetValue>0</resetValue>															
		<resetMask>0x00000000</resetMask>															
		<fields>															
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. These bits always read as zeroes.</description>													
				<bitRange>[5:0]</bitRange>													
			</field>														
			<field>														
				<name>V_VREF</name>													
				<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin selected by the SEL field, divided by the voltage on the VDD pin. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VSS, while 0x3FF indicates that the voltage on ADn was close to, equal to, or greater than that on VREF.</description>													
				<bitRange>[15:6]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. These bits always read as zeroes. They allow accumulation of successive A/D values without AND-masking, for at least 256 values without overflow into the CHN field.</description>													
				<bitRange>[23:16]</bitRange>													
			</field>														
			<field>														
				<name>CHN</name>													
				<description>These bits contain the channel from which the LS bits were converted.</description>													
				<bitRange>[26:24]</bitRange>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. These bits always read as zeroes.</description>													
				<bitRange>[29:27]</bitRange>													
			</field>														
			<field>														
				<name>OVERRUN</name>													
				<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the LS bits. In non-FIFO operation, this bit is cleared by reading this register.</description>													
				<bitRange>[30:30]</bitRange>													
			</field>														
			<field>														
				<name>DONE</name>													
				<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read and when the ADCR is written. If the ADCR is written while a conversion is still in progress, this bit is set and a new conversion is started.</description>													
				<bitRange>[31:31]</bitRange>													
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>SEL</name>															
		<description>A/D Select Register. Selects between external pins and internal sources.</description>															
		<addressOffset>0x008</addressOffset>															
		<access>read-write</access>															
		<resetValue>0</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>RESERVED</name>													
				<description>Reserved. Always write zeroes to these bits.</description>													
				<bitRange>[9:0]</bitRange>													
												
