cmsis-svd/cmsis-svd/data/NXP/LPC11Axxv0.6.xml
</registers>																	

			
		</peripheral>
		<peripheral>
			<name>DAC</name>
			<description>DAC</description>
			<groupName>DAC</groupName>
			<baseAddress>0x40024000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>	
			<interrupt>
				<name>DAC</name>
				<value>11</value>
			</interrupt>
			<registers>																						
				<register>																					
					<name>CR</name>																				
					<description>D/A control register</description>																				
					<addressOffset>0x000</addressOffset>																				
					<access>read-write</access>																				
					<resetValue>0</resetValue>																				
					<resetMask>0xFFFFFFFF</resetMask>																				
					<fields>																				
						<field>																			
							<name>RESERVED</name>																		
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																		
							<bitRange>[5:0]</bitRange>																		
																								
						</field>																			
						<field>																			
							<name>VALUE</name>																		
							<description>After the selected settling time after a conversion begins, the voltage on the AOUT pin (with respect to VSS) is VALUE x (V DD/1024).</description>																		
							<bitRange>[15:6]</bitRange>																		
																								
						</field>																			
						<field>																			
							<name>BIAS</name>																		
							<description>Settling time</description>																		
							<bitRange>[16:16]</bitRange>																		
							<enumeratedValues>																		
								<name>ENUM</name>																		
								<enumeratedValue>																	
									<name>FAST</name>																
									<description>The settling time of the DAC is 1 us max, and the maximum current is 700 uA. This allows a maximum update rate of 1 MHz.</description>																
									<value>0</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>SLOW</name>																
									<description>The settling time of the DAC is 2.5 us and the maximum current is 350 uA. This allows a maximum update rate of 400 kHz.</description>																
									<value>1</value>																
								</enumeratedValue>																	
							</enumeratedValues>																		
						</field>																			
						<field>																			
							<name>TRIG</name>																		
							<description>The value written to this field determines whether conversion begins immediately after this register is written, or whether conversion is delayed until a selected event occurs.</description>																		
							<bitRange>[19:17]</bitRange>																		
							<enumeratedValues>																		
								<name>ENUM</name>																		
								<enumeratedValue>																	
									<name>IMMEDIATE</name>																
									<description>Conversion begins when this register is written, and AOUT begins to change to the new voltage immediately. For all other values in this field, AOUT remains at its previous voltage until the selected event has occurred.</description>																
									<value>0x0</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>COMPLEVELOUT</name>																
									<description>Conversion is triggered by the selected edge(s) on the analog comparator (level) output</description>																
									<value>0x1</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>ATRG0EDGE</name>																
									<description>Conversion is triggered by the selected edge(s) on ATRG0.</description>																
									<value>0x2</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>ATRG1EDGE</name>																
									<description>Conversion is triggered by the selected edge(s) on ATRG1.</description>																
									<value>0x3</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>CT32B1_MAT0EDGE</name>																
									<description>Conversion is triggered by the selected edge(s) on CT32B1_MAT0 [2].</description>																
									<value>0x4</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>CT32B1_MAT1EDGE</name>																
									<description>Conversion is triggered by the selected edge(s) on CT32B1_MAT1[2].</description>																
									<value>0x5</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>CT16B1_MAT0EDGE</name>																
									<description>Conversion is triggered by the selected edge(s) on CT16B1_MAT0[2].</description>																
									<value>0x6</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>CT16B1_MAT1EDGE</name>																
									<description>Conversion is triggered by the selected edge(s) on CT16B1_MAT1[2].</description>																
									<value>0x7</value>																
								</enumeratedValue>																	
							</enumeratedValues>																		
						</field>																			
						<field>																			
							<name>RESERVED</name>																		
							<description>Reserved.</description>																		
							<bitRange>[20:20]</bitRange>																		
																								
