cmsis-svd/cmsis-svd/data/NXP/LPC11Axxv0.6.xml
						</field>																			
						<field>																			
							<name>EDGESEL</name>																		
							<description>For non-zero values of TRIG, this field selects when the conversion is triggered:</description>																		
							<bitRange>[22:21]</bitRange>																		
							<enumeratedValues>																		
								<name>ENUM</name>																		
								<enumeratedValue>																	
									<name>FALLING</name>																
									<description>Falling edges</description>																
									<value>0x0</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>RISINGs</name>																
									<description>Rising edges</description>																
									<value>0x1</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>DUALEDGE</name>																
									<description>Both edges</description>																
									<value>0x2</value>																
								</enumeratedValue>																	
								<enumeratedValue>																	
									<name>DUALEDGE</name>																
									<description>Both edges</description>																
									<value>0x3</value>																
								</enumeratedValue>																	
							</enumeratedValues>																		
						</field>																			
						<field>																			
							<name>TRIGERD</name>																		
							<description>If the TRIG field (above) is non-zero, this bit is set when a conversion is triggered, and is cleared by any write to this register.</description>																		
							<bitRange>[23:23]</bitRange>																		
																								
						</field>																			
						<field>																			
							<name>RESERVED</name>																		
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																		
							<bitRange>[31:24]</bitRange>																		
																								
						</field>																			
					</fields>																				
				</register>		
				
				<register>																					
					<name>RESERVED</name>																				
					<description>Reserved</description>																				
					<addressOffset>0x004</addressOffset>																				
					<access>read-write</access>																				
					<resetValue>0</resetValue>																				
					<resetMask>0xFFFFFFFF</resetMask>																				
					<fields>																				
						<field>																			
							<name>RESERVED</name>																		
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																		
							<bitRange>[31:0]</bitRange>																		
							
						</field>																			
																									
																									
																									
																									
																									
																									
																									
					</fields>																				
				</register>
			</registers>																						
			
		</peripheral>
		<peripheral>
        <name>CMP</name>
        <description>Comparator</description>
        <groupName>Comparator</groupName>
        <baseAddress>0x40028000</baseAddress>
		<addressBlock>
			<offset>0x0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>	
			<interrupt>
				<name>CMP</name>
				<value>10</value>
			</interrupt>
		<registers>																							
			<register>																						
				<name>CTL</name>																					
				<description>Comparator control register</description>																					
				<addressOffset>0x000</addressOffset>																					
				<access>read-write</access>																					
				<resetValue>0</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved. Write as 0.</description>																			
						<bitRange>[2:0]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>EDGESEL</name>																			
						<description>This field controls which edges on the comparator output set the COMPEDGE bit (bit 23 below): 00 = Falling edges 01 = Rising edges 1x = Both edges</description>																			
						<bitRange>[4:3]</bitRange>																			
						<enumeratedValues>																			
						<name>ENUM</name>																			
							<enumeratedValue>																		
								<name>FALLING</name>																	
								<description>Falling edges</description>																	
								<value>0x0</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>RISING</name>																	
								<description>Rising edges</description>																	
								<value>0x1</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>DUALEDGE</name>																	
								<description>Both edges</description>																	
								<value>0x2</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>DUALEDGE</name>																	
								<description>Both edges</description>																	
								<value>0x3</value>																	
							</enumeratedValue>																		
						</enumeratedValues>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved. Write as 0.</description>																			
						<bitRange>[5:5]</bitRange>																			
																							
