cmsis-svd/cmsis-svd/data/NXP/LPC11Axxv0.6.xml
					</field>																				
					<field>																				
						<name>COMPSA</name>																			
						<description>Comarator output control</description>																			
						<bitRange>[6:6]</bitRange>																			
						<enumeratedValues>																			
						<name>ENUM</name>																			
							<enumeratedValue>																		
								<name>DIRECT</name>																	
								<description>Uses the comparator output directly.</description>																	
								<value>0</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>SYNCH</name>																	
								<description>Synchronizes the comparator output to the bus clock for output to other modules.</description>																	
								<value>1</value>																	
							</enumeratedValue>																		
						</enumeratedValues>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved. Write as 0.</description>																			
						<bitRange>[7:7]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>COMP_VP_SEL</name>																			
						<description>Selects positive voltage input</description>																			
						<bitRange>[10:8]</bitRange>																			
						<enumeratedValues>																			
						<name>ENUM</name>																			
							<enumeratedValue>																		
								<name>VLADOUT</name>																	
								<description>voltage ladder output</description>																	
								<value>0x0</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI1</name>																	
								<description>ACMPI1</description>																	
								<value>0x1</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI2</name>																	
								<description>ACMPI2</description>																	
								<value>0x2</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI3</name>																	
								<description>ACMPI3</description>																	
								<value>0x3</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI4</name>																	
								<description>ACMPI4</description>																	
								<value>0x4</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI5</name>																	
								<description>ACMPI5</description>																	
								<value>0x5</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>INTVOLTAGEREF</name>																	
								<description>internal reference voltage</description>																	
								<value>0x6</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>TEMPSENSOR</name>																	
								<description>temperature sensor</description>																	
								<value>0x7</value>																	
							</enumeratedValue>																		
						</enumeratedValues>																			
					</field>																				
					<field>																				
						<name>COMP_VM_SEL</name>																			
						<description>Selects negative voltage input</description>																			
						<bitRange>[13:11]</bitRange>																			
						<enumeratedValues>																			
						<name>ENUM</name>																			
							<enumeratedValue>																		
								<name>VLADDOUT</name>																	
								<description>voltage ladder output</description>																	
								<value>0x0</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI1</name>																	
								<description>ACMPI1</description>																	
								<value>0x1</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI2</name>																	
								<description>ACMPI2</description>																	
								<value>0x2</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI3</name>																	
								<description>ACMPI3</description>																	
								<value>0x3</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI4</name>																	
								<description>ACMPI4</description>																	
								<value>0x4</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>ACMPI5</name>																	
								<description>ACMPI5</description>																	
								<value>0x5</value>																	
							</enumeratedValue>																		
							<enumeratedValue>																		
								<name>INTVOLTAGEREF</name>																	
								<description>internal reference voltage</description>																	
								<value>0x6</value>																	
							</enumeratedValue>																		
						</enumeratedValues>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved. Write as 0.</description>																			
						<bitRange>[19:14]</bitRange>																			
																							
					</field>																				
					<field>																				
						<name>EDGECLR</name>																			
						<description>Interrupt clear bit. Writing a 1 to this bit clears the COMPEDGE bit (bit 23 below) and thus negates the interrupt request.</description>																			
						<bitRange>[20:20]</bitRange>																			
																							
