cmsis-svd/cmsis-svd/data/NXP/LPC11Axxv0.6.xml
   <register>
      <name>TMS_PIO0_7</name>
      <description>I/O configuration register for pin TMS/PIO0_7/AD1/ CT32B1_CAP0/ CT16B0_MAT0</description>
      <addressOffset>0x1C</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000090</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin TMS/PIO0_7/AD1/ CT32B1_CAP0/ CT16B0_MAT0</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>TMS</name>
                  <description>Test Mode Select for JTAG interface. Input glitch filter
                                    (10 ns) capable.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PIO0_7</name>
                  <description>General purpose digital input/output pin. Input glitch                                     filter (10 ns) capable.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>AD1</name>
                  <description>A/D converter input 1.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT32B1_CAP0</name>
                  <description>Capture input 0 for 32-bit timer 1. Input glitch filter                                     (10 ns) capable.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT16B0_MAT0</name>
                  <description>Match output 2 for 16-bit timer 0.</description>
                  <value>0x4</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>ADMODE</name>
            <description>Selects Analog/Digital mode.</description>
            <bitRange>[7:7]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>ANALOG_INPUT_MODE_</name>
                  <description>Analog input mode.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>DIGITAL_FUNCTIONAL_M</name>
                  <description>Digital functional mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>FILTR</name>
            <description>Selects 10 ns input glitch filter.</description>
            <bitRange>[8:8]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>FILTER_DISABLED_</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FILTER_ENABLED_</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[9:9]</bitRange>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled.  This is not a true open-drain mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>TDO_PIO0_8</name>
      <description>I/O configuration register for pin TDO/PIO0_8/AD2/ CT32B1_MAT0/SCK1</description>
      <addressOffset>0x20</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000090</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin TDO/PIO0_8/AD2/ CT32B1_MAT0/SCK1</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>TDO</name>
                  <description>Test Data Out for JTAG interface.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PIO0_8</name>
                  <description>General purpose digital input/output pin. Input glitch                                     filter (10 ns) capable.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>AD2</name>
                  <description>A/D converter input 2.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT32B1_MAT0</name>
                  <description>Match output 0 for 32-bit timer 1.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SCK1</name>
                  <description>Serial clock for SSP1. Input glitch filter (10 ns)                                     capable.</description>
                  <value>0x4</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>ADMODE</name>
            <description>Selects Analog/Digital mode.</description>
            <bitRange>[7:7]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>ANALOG_INPUT_MODE_</name>
                  <description>Analog input mode.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>DIGITAL_FUNCTIONAL_M</name>
                  <description>Digital functional mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>FILTR</name>
            <description>Selects 10 ns input glitch filter.</description>
            <bitRange>[8:8]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>FILTER_DISABLED_</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FILTER_ENABLED_</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[9:9]</bitRange>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled.  This is not a true open-drain mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>TRST_PIO0_9</name>
      <description>I/O configuration register for pin TRST/PIO0_9/AD3/CT32B1_MAT1/CT16B0_MAT1/CTS</description>
      <addressOffset>0x24</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000090</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin TRST/PIO0_9/AD3/CT32B1_MAT1/CT16B0_MAT1/CTS</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>TRST</name>
                  <description>Test Reset for JTAG interface. Input glitch filter (10
                                    ns) capable.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PIO0_9</name>
                  <description>General purpose digital input/output pin. Input glitch                                     filter (10 ns) capable.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>AD3</name>
                  <description>A/D converter, input 3.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT32B1_MAT1</name>
                  <description>Match output 1 for 32-bit timer 1.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT16B0_MAT1</name>
                  <description>Match output 1 for 16-bit timer 0.</description>
                  <value>0x4</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CTS</name>
                  <description>Clear To Send input for USART. Input glitch filter (10                                     ns) capable.</description>
                  <value>0x5</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>ADMODE</name>
            <description>Selects Analog/Digital mode.</description>
            <bitRange>[7:7]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>ANALOG_INPUT_MODE_</name>
                  <description>Analog input mode.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>DIGITAL_FUNCTIONAL_M</name>
                  <description>Digital functional mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>FILTR</name>
            <description>Selects 10 ns input glitch filter.</description>
            <bitRange>[8:8]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>FILTER_DISABLED_</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FILTER_ENABLED_</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[9:9]</bitRange>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled.  This is not a true open-drain mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
