cmsis-svd/cmsis-svd/data/NXP/LPC11Axxv0.6.xml
   </registers>





   
 
	
</peripheral>


		<peripheral>
		<name>SYSCON</name>
		<description>System configuration </description>
		<groupName>SYSCON</groupName>
		<baseAddress>0x40048000</baseAddress>
		<addressBlock>
		<offset>0x0</offset>
		<size>0xFFF</size>
		<usage>registers</usage>
		</addressBlock>
			<interrupt>
				<name>BOD</name>
				<value>26</value>
			</interrupt>
			<interrupt>
				<name>RESERVED0</name>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>RESERVED1</name>
				<value>13</value>
			</interrupt>
			<interrupt>
				<name>RESERVED2</name>
				<value>22</value>
			</interrupt>
			<interrupt>
				<name>RESERVED3</name>
				<value>23</value>
			</interrupt>
			<interrupt>
				<name>RESERVED4</name>
				<value>28</value>
			</interrupt>
			<interrupt>
				<name>RESERVED5</name>
				<value>29</value>
			</interrupt>
			<interrupt>
				<name>RESERVED6</name>
				<value>30</value>
			</interrupt>
			<interrupt>
				<name>RESERVED7</name>
				<value>31</value>
			</interrupt>
				<registers>
		<register>
			<name>SYSMEMREMAP</name>
			<description>System memory remap</description>
			<addressOffset>0x0</addressOffset>
			<access>read-write</access>
			<resetValue>0x02</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MAP</name>
					<description>System memory remap</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BOOT_LOADER_MODE_IN</name>
							<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_RAM_MODE_INTER</name>
							<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>USER_FLASH_MODE_INT</name>
							<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:2]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>PRESETCTRL</name>
			<description>Peripheral reset control</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SSP0_RST_N</name>
					<description>SSP0 reset control</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_SSP0_PERI</name>
							<description>Resets the SSP0 peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP0_RESET_DE_ASSERT</name>
							<description>SSP0 reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2C_RST_N</name>
					<description>I2C reset control</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_I2C_PERIP</name>
							<description>Resets the I2C peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>I2C_RESET_DE_ASSERTE</name>
							<description>I2C reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SSP1_RST_N</name>
					<description>SSP1 reset control</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_SSP1_PERI</name>
							<description>Resets the SSP1 peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SSP1_RESET_DE_ASSERT</name>
							<description>SSP1 reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[3:3]</bitRange>

				</field>
				<field>
					<name>UART_RST_N</name>
					<description>UART reset control</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_UART_PERI</name>
							<description>Resets the UART peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UART_RESET_DE_ASSERT</name>
							<description>UART reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT16B0_RST_N</name>
					<description>CT16B0 reset control</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_CT16B0_PE</name>
							<description>Resets the CT16B0 peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT16B0_RESET_DE_ASSE</name>
							<description>CT16B0 reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT16B1_RST_N</name>
					<description>CT16B1 reset control</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_CT16B1_PE</name>
							<description>Resets the CT16B1 peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT16B1_RESET_DE_ASSE</name>
							<description>CT16B1 reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT32B0_RST_N</name>
					<description>CT32B0 reset control</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_CT32B0_PE</name>
							<description>Resets the CT32B0 peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT32B0_RESET_DE_ASSE</name>
							<description>CT32B0 reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CT32B1_RST_N</name>
					<description>CT32B1 reset control</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_CT32B1_PE</name>
							<description>Resets the CT32B1 peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT32B1_RESET_DE_ASSE</name>
							<description>CT32B1 reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ACOMP_RST_N</name>
					<description>Analog comparator reset control</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_ANALOG_CO</name>
							<description>Resets the Analog comparator peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ANALOG_COMPARATOR_RE</name>
							<description>Analog comparator reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DAC_RST_N</name>
					<description>DAC reset control</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_DAC_PERIP</name>
							<description>Resets the DAC peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DAC_RESET_DE_ASSERTE</name>
							<description>DAC reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADC_RST_N</name>
					<description>ADC reset control</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESETS_THE_ADC_PERIP</name>
							<description>Resets the ADC peripheral.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ADC_RESET_DE_ASSERTE</name>
							<description>ADC reset de-asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:12]</bitRange>

