cmsis-svd/cmsis-svd/data/NXP/LPC11Axxv0.6.xml
				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTUEN</name>
			<description>CLKOUT clock source update enable</description>
			<addressOffset>0x0E4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ENA</name>
					<description>Enable CLKOUT clock source update</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_CHANGE</name>
							<description>No change</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>UPDATE_CLOCK_SOURCE</name>
							<description>Update clock source</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:1]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTDIV</name>
			<description>CLKOUT clock divider</description>
			<addressOffset>0x0E8</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DIV</name>
					<description>CLKOUT clock divider values 0: Disable CLKOUT clock divider.  1: Divide by 1. to 255: Divide by 255.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIOPORCAP0</name>
			<description>POR captured PIO status 0</description>
			<addressOffset>0x100</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>PIOSTAT</name>
					<description>State of PIO0_31 through PIO0_0 at power-on reset</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PIOPORCAP1</name>
			<description>POR captured PIO status 1</description>
			<addressOffset>0x104</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>PIOSTAT</name>
					<description>State of PIO1_9 through PIO1_0 at power-on reset</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>BODR</name>
			<description>Brown-Out Detect</description>
			<addressOffset>0x150</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[1:0]</bitRange>

				</field>
				<field>
					<name>BODINTVAL</name>
					<description>BOD interrupt threshold</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LEVEL_2_THE_INTERRU</name>
							<description>Level 2: the interrupt assertion threshold voltage is 2.52 V; the interrupt de-assertion threshold voltage is 2.66 V.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LEVEL_3_THE_INTERRU</name>
							<description>Level 3: the interrupt assertion threshold voltage is 2.80 V; the interrupt de-assertion threshold voltage is 2.90 V.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[4:4]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[5:5]</bitRange>

				</field>
				<field>
					<name>BODINT</name>
					<description>This bit is 1 if the BOD is requesting an interrupt.</description>
					<bitRange>[6:6]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:7]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>SYSTCKCAL</name>
			<description>System tick counter calibration</description>
			<addressOffset>0x158</addressOffset>
			<access>read-write</access>
			<resetValue>0x004</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAL</name>
					<description>System tick timer calibration value</description>
					<bitRange>[25:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:26]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>NMISRC</name>
			<description>NMI Source Control</description>
			<addressOffset>0x174</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IRQNO</name>
					<description>The IRQ number of the interrupt that is to act as the Non-Maskable interrupt (NMI) if bit 31 is 1. See Section 4.3 for the list of interrupt sources and their IRQ numbers.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[30:5]</bitRange>
				</field>
				<field>
					<name>NMIEN</name>
					<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>8</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-7</dimIndex>
			<name>PINTSEL%s</name>
			<description>GPIO Pin Interrupt Select register 0</description>
			<addressOffset>0x178</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTPIN</name>
					<description>The pin number within the port identified by the INTPORT field.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>INTPORT</name>
					<description>Select the port: 0 = P0 pin. 1 = P1 pin.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PDRUNCFG</name>
			<description>Power configuration register</description>
			<addressOffset>0x238</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000EDF0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IRCOUT_PD</name>
					<description>IRC oscillator output power-down</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>IRC_PD</name>
					<description>IRC oscillator power-down</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FLASH_PD</name>
					<description>Flash power-down</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED_DOWN</name>
							<description>Powered down</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERED</name>
							<description>Powered</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[3:3]</bitRange>

